#TODO: split into multiple files?
#this is only for default pkgmgr (currently ubuntu/debian)

#ubuntu/debian base
aptitude

#shell
vim
zsh
silversearcher-ag
htop
tmux
ssh-client
rsync
git
rgxg
gawk
# cant live without "column -t"
bsdmainutils
# https://xkcd.com/1168/
unp
curl

#laptop
powertop

#not on localhost
#ledger
#mutt
#remind

#programming
vim
git
sqlite3
##shell
shellcheck
##perl
perltidy

#sysadmin
openconnect
rsync
oping
hping3
mtr-tiny
htop
sysdig
tcpdump
strace
lsof
telnet
rgxg
#ansible
#rkhunter
#etckeeper

#$need $name
autossh
# moreutils is for vidir
moreutils
vcsh
less
mr
jq
bc
ncdu

#container
#docker - not via default pkg manager

#desktop
firejail
redshift
xubuntu-desktop
firefox
xsel

ffmpeg
libav-tools

#youtube-dl
#xdotool
#quodlibet
#soundconverter

#
python-pip

#fun
#sl
#figlet


# todo: (not used atm / i want to take a look)
# slurm
