#TODO: split into multiple files?
#this is only for default pkgmgr (currently ubuntu/debian)

#shell
vim
zsh
htop
tmux
ssh-client
rsync
git
rgxg

#programming
vim
git
##shell
shellcheck
##perl
perltidy

#sysadmin
rsync
oping
hping3
mtr-tiny
htop
sysdig
tcpdump
strace
lsof
telnet
rgxg

#$need $name
autossh
moreutils
vcsh
less
mr
jq
bc
ncdu

#container
#docker - not via default pkg manager

#desktop
xfce4
firefox
